trade_exp/src/Catalogs/ВидыЦенПоставщиков/ВидыЦенПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыЦенПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="3c2f91fc-45cd-43e2-aa03-0f0e242a13c1">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="10d3d44e-e5fe-448d-bbbc-8dcde99350a8">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de6c3fd2-3216-4234-a824-1aeeb7c16572">
    <name>ДоступноДляЗакупки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8697945-c58b-4cef-bbf8-1e8bd9b57e41">
    <name>ДоступноДляПродажиКлиентам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8f2e4c9-3ceb-4266-a8c6-a74d7b367b76">
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="06c0866a-4510-4290-943d-3850b5245d36">
    <name>ГруппаВидовЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3371f83-b09a-4198-bc28-7a2aed51b386">
    <name>РегионПрисутствия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="763d01e8-ea69-4acd-b052-c945b77d303c">
    <name>ФорматПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ВидыЦенПоставщиков/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Док_ВладелецПриИзмененииПосле(Элемент) 
	Если ЗначениеЗаполнено(Объект.Владелец) И ВладелецКонкурент(Объект.Владелец) Тогда
		Объект.ЦенаВключаетНДС = Истина;
		Объект.ДоступноДляПродажиКлиентам = Истина;
		Объект.ДоступноДляЗакупки = Ложь;
	КонецЕсли;
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВладелецКонкурент(Владелец)
	Возврат Владелец.Парсинг;
КонецФункции

&НаКлиенте
Процедура Док_ГруппаВидовЦенПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаКлиенте
Процедура Док_РегионПрисутствияПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры

&НаКлиенте
Процедура Док_ФорматПодразделенияПриИзмененииПосле(Элемент)
	Название = "";
	Если ЗначениеЗаполнено(Объект.ГруппаВидовЦен) Тогда
		Название = Название + (Объект.ГруппаВидовЦен);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.РегионПрисутствия) Тогда
		Название = Название+"_" + (Объект.РегионПрисутствия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ФорматПодразделения) Тогда
		Название = Название +"_"+ (Объект.ФорматПодразделения);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Название = Название+"_" + (Объект.Владелец);
	КонецЕсли;
	Объект.Наименование = Название;
КонецПроцедуры
